Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70N21.PIC
      <edc:SFRDef edc:_addr="0x4000C0D0" edc:access="-----------------------------rrr" edc:cname="TC0_QIMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C0D4" edc:access="-----------------------r-----rrr" edc:cname="TC0_QISR" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C0D8" edc:access="------------------------------nn" edc:cname="TC0_FMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ENCF0" edc:desc="Enable Compare Fault Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENCF1" edc:desc="Enable Compare Fault Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000C0DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4000C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="TC0_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x54494D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000C0E8" edc:offset="0xBF18"/>
      <edc:SFRDef edc:_addr="0x40018000" edc:access="--ww-w-w------wwwwwwwwwwwwwwwwww" edc:cname="TWIHS0_CR" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Send a START Condition" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Send a STOP Condition" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSEN" edc:desc="TWIHS Master Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSDIS" edc:desc="TWIHS Master Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVEN" edc:desc="TWIHS Slave Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVDIS" edc:desc="TWIHS Slave Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QUICK" edc:desc="SMBus Quick Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSEN" edc:desc="TWIHS High-Speed Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSDIS" edc:desc="TWIHS High-Speed Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBEN" edc:desc="SMBus Mode Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBDIS" edc:desc="SMBus Mode Disabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECEN" edc:desc="Packet Error Checking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECDIS" edc:desc="Packet Error Checking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PECRQ" edc:desc="PEC Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="Bus CLEAR Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMEN" edc:desc="Alternative Command Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMDIS" edc:desc="Alternative Command Mode Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="THRCLR" edc:desc="Transmit Holding Register Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKCLR" edc:desc="Lock Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:desc="FIFO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFODIS" edc:desc="FIFO Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018004" edc:access="---------nnnnnnn---n--nn--------" edc:cname="TWIHS0_MMR" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="IADRSZ" edc:desc="Internal Device Address Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No internal device address" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BYTE" edc:desc="One-byte internal device address" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BYTE" edc:desc="Two-byte internal device address" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BYTE" edc:desc="Three-byte internal device address" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MREAD" edc:desc="Master Read Direction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DADR" edc:desc="Device Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40018008" edc:access="nnnn-----nnnnnnn-nnnnnnn-n--nn-n" edc:cname="TWIHS0_SMR" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NACKEN" edc:desc="Slave Receiver Data Phase NACK enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMDA" edc:desc="SMBus Default Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMHH" edc:desc="SMBus Host Header" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SCLWSDIS" edc:desc="Clock Wait State Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Slave Address Mask" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR" edc:desc="Slave Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SADR1EN" edc:desc="Slave Address 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR2EN" edc:desc="Slave Address 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR3EN" edc:desc="Slave Address 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAMEN" edc:desc="Data Matching Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001800C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TWIHS0_IADR" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IADR" edc:desc="Internal Address" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
