Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70N21.PIC
      <edc:SFRDef edc:_addr="0x400507B0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW022" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507B4" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW122" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507B8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW023" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400507BC" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW123" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400507C0" edc:offset="0x3900"/>
      <edc:SFRDef edc:_addr="0x400540C0" edc:access="-------------------------------w" edc:cname="TC3_BCR" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchro Command" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540C4" edc:access="------nnnnnn--nnnnnnnnnn--nnnnnn" edc:cname="TC3_BMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:desc="External Clock Signal 0 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:desc="External Clock Signal 1 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:desc="External Clock Signal 2 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="QDEN" edc:desc="Quadrature Decoder Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSEN" edc:desc="Position Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPEEDEN" edc:desc="Speed Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QDTRANS" edc:desc="Quadrature Decoding Transparent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGPHA" edc:desc="Edge on PHA Count Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVA" edc:desc="Inverted PHA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVB" edc:desc="Inverted PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVIDX" edc:desc="Inverted Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:desc="Swap PHA and PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXPHB" edc:desc="Index Pin is PHB Pin" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MAXFILT" edc:desc="Maximum Filter" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
